peng-zhihui/HoloCubic/2.Firmware/HoloCubic-fw/lib/TFT_eSPI/Processors/TFT_eSPI_STM32.h
  #if defined (SSD1963_DRIVER)

    // Write 18 bit color to TFT (untested)
    #define tft_Write_16(C)  uint8_t r = (((C) & 0xF800)>> 8); uint8_t g = (((C) & 0x07E0)>> 3); uint8_t b = (((C) & 0x001F)<< 3); \
                             D0_PIN_PORT->BSRR = D8_BSR_MASK(r);  \
                             D1_PIN_PORT->BSRR = D9_BSR_MASK(r);  \
                             D2_PIN_PORT->BSRR = D10_BSR_MASK(r); \
                             D3_PIN_PORT->BSRR = D11_BSR_MASK(r); \
                             WR_L; \
                             D4_PIN_PORT->BSRR = D12_BSR_MASK(r); \
                             D5_PIN_PORT->BSRR = D13_BSR_MASK(r); \
                             D6_PIN_PORT->BSRR = D14_BSR_MASK(r); \
                             D7_PIN_PORT->BSRR = D15_BSR_MASK(r); \
                             WR_STB;\
                             D0_PIN_PORT->BSRR = D8_BSR_MASK(g);  \
                             D1_PIN_PORT->BSRR = D9_BSR_MASK(g);  \
                             D2_PIN_PORT->BSRR = D10_BSR_MASK(g); \
                             D3_PIN_PORT->BSRR = D11_BSR_MASK(g); \
                             WR_L; \
                             D4_PIN_PORT->BSRR = D12_BSR_MASK(g); \
                             D5_PIN_PORT->BSRR = D13_BSR_MASK(g); \
                             D6_PIN_PORT->BSRR = D14_BSR_MASK(g); \
                             D7_PIN_PORT->BSRR = D15_BSR_MASK(g); \
                             WR_STB;\
                             D0_PIN_PORT->BSRR = D0_BSR_MASK(b); \
                             D1_PIN_PORT->BSRR = D1_BSR_MASK(b); \
                             D2_PIN_PORT->BSRR = D2_BSR_MASK(b); \
                             D3_PIN_PORT->BSRR = D3_BSR_MASK(b); \
                             WR_L; \
                             D4_PIN_PORT->BSRR = D4_BSR_MASK(b); \
                             D5_PIN_PORT->BSRR = D5_BSR_MASK(b); \
                             D6_PIN_PORT->BSRR = D6_BSR_MASK(b); \
                             D7_PIN_PORT->BSRR = D7_BSR_MASK(b); \
                             WR_STB

    // 18 bit color write with swapped bytes
    #define tft_Write_16S(C) uint16_t Cswap = ((C) >>8 | (C) << 8); tft_Write_16(Cswap)

  #else

      // Write 16 bits to TFT
      #define tft_Write_16(C)  D0_PIN_PORT->BSRR = D8_BSR_MASK(C);  \
                               D1_PIN_PORT->BSRR = D9_BSR_MASK(C);  \
                               D2_PIN_PORT->BSRR = D10_BSR_MASK(C); \
                               D3_PIN_PORT->BSRR = D11_BSR_MASK(C); \
                               WR_L; \
                               D4_PIN_PORT->BSRR = D12_BSR_MASK(C); \
                               D5_PIN_PORT->BSRR = D13_BSR_MASK(C); \
                               D6_PIN_PORT->BSRR = D14_BSR_MASK(C); \
                               D7_PIN_PORT->BSRR = D15_BSR_MASK(C); \
                               WR_STB;\
                               D0_PIN_PORT->BSRR = D0_BSR_MASK(C); \
                               D1_PIN_PORT->BSRR = D1_BSR_MASK(C); \
                               D2_PIN_PORT->BSRR = D2_BSR_MASK(C); \
                               D3_PIN_PORT->BSRR = D3_BSR_MASK(C); \
                               WR_L; \
                               D4_PIN_PORT->BSRR = D4_BSR_MASK(C); \
                               D5_PIN_PORT->BSRR = D5_BSR_MASK(C); \
                               D6_PIN_PORT->BSRR = D6_BSR_MASK(C); \
                               D7_PIN_PORT->BSRR = D7_BSR_MASK(C); \
                               WR_STB

      // 16 bit write with swapped bytes
      #define tft_Write_16S(C) D0_PIN_PORT->BSRR = D0_BSR_MASK(C); \
                               D1_PIN_PORT->BSRR = D1_BSR_MASK(C); \
                               D2_PIN_PORT->BSRR = D2_BSR_MASK(C); \
                               D3_PIN_PORT->BSRR = D3_BSR_MASK(C); \
                               WR_L; \
                               D4_PIN_PORT->BSRR = D4_BSR_MASK(C); \
                               D5_PIN_PORT->BSRR = D5_BSR_MASK(C); \
                               D6_PIN_PORT->BSRR = D6_BSR_MASK(C); \
                               D7_PIN_PORT->BSRR = D7_BSR_MASK(C); \
                               WR_STB; \
                               D0_PIN_PORT->BSRR = D8_BSR_MASK(C);  \
                               D1_PIN_PORT->BSRR = D9_BSR_MASK(C);  \
                               D2_PIN_PORT->BSRR = D10_BSR_MASK(C); \
                               D3_PIN_PORT->BSRR = D11_BSR_MASK(C); \
                               WR_L; \
                               D4_PIN_PORT->BSRR = D12_BSR_MASK(C); \
                               D5_PIN_PORT->BSRR = D13_BSR_MASK(C); \
                               D6_PIN_PORT->BSRR = D14_BSR_MASK(C); \
                               D7_PIN_PORT->BSRR = D15_BSR_MASK(C); \
                               WR_STB
  #endif

      #define tft_Write_32(C)    tft_Write_16((uint16_t)((C)>>16)); tft_Write_16((uint16_t)(C))

      #define tft_Write_32C(C,D) tft_Write_16((uint16_t)(C)); tft_Write_16((uint16_t)(D))

      #define tft_Write_32D(C)   tft_Write_16((uint16_t)(C)); tft_Write_16((uint16_t)(C))

      // Read a data bit
      #define RD_TFT_D0 ((((D0_PIN_PORT->IDR) >> (D0_PIN_BIT))&1)<<0) // Read pin TFT_D0
      #define RD_TFT_D1 ((((D1_PIN_PORT->IDR) >> (D1_PIN_BIT))&1)<<1) // Read pin TFT_D1
      #define RD_TFT_D2 ((((D2_PIN_PORT->IDR) >> (D2_PIN_BIT))&1)<<2) // Read pin TFT_D2
      #define RD_TFT_D3 ((((D3_PIN_PORT->IDR) >> (D3_PIN_BIT))&1)<<3) // Read pin TFT_D3
      #define RD_TFT_D4 ((((D4_PIN_PORT->IDR) >> (D4_PIN_BIT))&1)<<4) // Read pin TFT_D4
      #define RD_TFT_D5 ((((D5_PIN_PORT->IDR) >> (D5_PIN_BIT))&1)<<5) // Read pin TFT_D5
      #define RD_TFT_D6 ((((D6_PIN_PORT->IDR) >> (D6_PIN_BIT))&1)<<6) // Read pin TFT_D6
      #define RD_TFT_D7 ((((D7_PIN_PORT->IDR) >> (D7_PIN_BIT))&1)<<7) // Read pin TFT_D7
    #endif
  #endif
////////////////////////////////////////////////////////////////////////////////////////
// Macros to write commands/pixel colour data to a SPI ILI948x TFT
////////////////////////////////////////////////////////////////////////////////////////
#elif  defined (SPI_18BIT_DRIVER) // SPI 18 bit colour

  // Write 8 bits to TFT
  #define tft_Write_8(C) \
  { spiBuffer[0] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 1, 10); }

  // Convert 16 bit colour to 18 bit and write in 3 bytes
  #define tft_Write_16(C) \
  { spiBuffer[0] = ((C) & 0xF800)>>8; spiBuffer[1] = ((C) & 0x07E0)>>3; spiBuffer[2] = ((C) & 0x001F)<<3; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 3, 10); }

  // Convert swapped byte 16 bit colour to 18 bit and write in 3 bytes
  #define tft_Write_16S(C) \
  { spiBuffer[0] = (C) & 0xF8; spiBuffer[1] = ((C) & 0xE000)>>11 | ((C) & 0x07)<<5; spiBuffer[2] = ((C) & 0x1F00)>>5; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 3, 10); }

  // Write 32 bits to TFT
  #define tft_Write_32(C) \
  { spiBuffer[0] = (C)>>24; spiBuffer[1] = (C)>>16; spiBuffer[2] = (C)>>8; spiBuffer[3] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 4, 10); }

  // Write two address coordinates
  #define tft_Write_32C(C,D) \
  { spiBuffer[0] = (C)>>8; spiBuffer[1] = C; spiBuffer[2] = (D)>>8; spiBuffer[3] = D; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 4, 10); }

  // Write same value twice
  #define tft_Write_32D(C) \
  { spiBuffer[0] = spiBuffer[2] = (C)>>8; spiBuffer[1] = spiBuffer[3] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 4, 10); }

////////////////////////////////////////////////////////////////////////////////////////
// Macros to write commands/pixel colour data to a SPI Raspberry Pi TFT
////////////////////////////////////////////////////////////////////////////////////////
#elif  defined (RPI_DISPLAY_TYPE)

  #define tft_Write_8(C) \
  { spiBuffer[0] = 0; spiBuffer[1] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 2, 10); }

  #define tft_Write_16(C) \
  { spiBuffer[0] = (C)>>8; spiBuffer[1] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 2, 10); }

  #define tft_Write_16S(C) \
  { spiBuffer[0] = C; spiBuffer[1] = (C)>>8; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 2, 10); }

