peng-zhihui/HoloCubic/2.Firmware/HoloCubic-fw/lib/TFT_eSPI/Processors/TFT_eSPI_STM32.h
  #define tft_Write_32(C) \
  { spiBuffer[1] = ((C)>>24); spiBuffer[3] = ((C)>>16); spiBuffer[5] = ((C)>>8); spiBuffer[7] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 8, 10); }

  #define tft_Write_32C(C,D) \
  { spiBuffer[1] = ((C)>>8); spiBuffer[3] = (C); spiBuffer[5] = ((D)>>8); spiBuffer[7] = D; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 8, 10); }

  #define tft_Write_32D(C) \
  { spiBuffer[1] = ((C)>>8); spiBuffer[3] = (C); spiBuffer[5] = ((C)>>8); spiBuffer[7] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 8, 10); }

////////////////////////////////////////////////////////////////////////////////////////
// Macros for all other SPI displays
////////////////////////////////////////////////////////////////////////////////////////

#else

  #if defined(ST7789_DRIVER) || defined(ST7789_2_DRIVER)
    // Temporary workaround for issue #510 part 2
    #define tft_Write_8(C)   spi.transfer(C)
  #else
    #define tft_Write_8(C) \
    { spiBuffer[0] = C; \
    HAL_SPI_Transmit(&spiHal, spiBuffer, 1, 10); delayMicroseconds(1);}
  #endif

  #define tft_Write_16(C) \
  { spiBuffer[0] = (C)>>8; spiBuffer[1] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 2, 10); }

  #define tft_Write_16S(C) \
  { spiBuffer[0] = C; spiBuffer[1] = (C)>>8; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 2, 10); }

  #define tft_Write_32(C) \
  { spiBuffer[0] = (C)>>24; spiBuffer[1] = (C)>>16; spiBuffer[2] = (C)>>8; spiBuffer[3] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 4, 10); }

  #define tft_Write_32C(C,D) \
  { spiBuffer[0] = (C)>>8; spiBuffer[1] = C; spiBuffer[2] = (D)>>8; spiBuffer[3] = D; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 4, 10); }

  #define tft_Write_32D(C) \
  { spiBuffer[0] = spiBuffer[2] = (C)>>8; spiBuffer[1] = spiBuffer[3] = C; \
  HAL_SPI_Transmit(&spiHal, spiBuffer, 4, 10); }

#endif

////////////////////////////////////////////////////////////////////////////////////////
// Macros to read from display using SPI or software SPI
////////////////////////////////////////////////////////////////////////////////////////
#if defined (TFT_SDA_READ)
  // Macros to support a bit banged function call for STM32 and bi-directional SDA pin
  #define TFT_eSPI_ENABLE_8_BIT_READ // Enable tft_Read_8();
  #define SCLK_L digitalWrite(TFT_SCLK, LOW)
  #define SCLK_H digitalWrite(TFT_SCLK, HIGH)
#elif !defined (TFT_PARALLEL_8_BIT)
  // Use a SPI read transfer
  #define tft_Read_8() spi.transfer(0)
#endif

#endif // Header end
